cospec_benchmarks/B_disable_by_batch_20250629_145622/disable_by_batch_3_8_alpaca_output.txt
INFO 06-29 15:09:11 [__init__.py:239] Automatically detected platform cuda.
Namespace(backend='vllm', base_url=None, host='127.0.0.1', port=8100, endpoint='/v1/completions', dataset_name='alpaca', dataset_path=None, max_concurrency=None, model='huggyllama/llama-13b', tokenizer=None, use_beam_search=False, num_prompts=4800, logprobs=None, request_rate=8.0, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el,token_latency', metric_percentiles='99', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None)
Loaded 52002 samples from cache from vicgalle/cache/alpaca_huggyllama/llama-13b.json
Split dataset into 5200 test samples and 46802 training samples
Running test split to train selective validator...
Checking server health at http://127.0.0.1:8100/health
Server is ready!
Running full benchmark...
Checking server health at http://127.0.0.1:8100/health
Server is ready!
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: 8.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
Benchmark will process 4800 prompts
============ Serving Benchmark Result ============
Successful requests:                     4800      
Benchmark duration (s):                  612.54    
Total input tokens:                      294009    
Total generated tokens:                  809929    
Request throughput (req/s):              7.84      
Output token throughput (tok/s):         1322.24   
Total Token throughput (tok/s):          1802.22   
---------------Time to First Token----------------
Mean TTFT (ms):                          82.96     
Median TTFT (ms):                        79.47     
P99 TTFT (ms):                           144.99    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          37.57     
Median TPOT (ms):                        38.57     
P99 TPOT (ms):                           48.86     
---------------Inter-token Latency----------------
Mean ITL (ms):                           39.01     
Median ITL (ms):                         37.23     
P99 ITL (ms):                            61.63     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          6341.19   
Median E2EL (ms):                        4598.00   
P99 E2EL (ms):                           22262.54  
-----Token Latency (e2e_latency / output_len)-----
Mean Token Latency (ms):                 38.64     
Median Token Latency (ms):               39.33     
P99 Token Latency (ms):                  51.65     
==================================================